In [1]:
%load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

In [3]:
%sql create table contests(contest_id int(20), hacker_id int(20), name char(10))

 * sqlite://
Done.

[]

In [5]:
%%sql 
insert into contests (contest_id, hacker_id, name)
values
(66406,17973,'Rose'),
(6656,79153,'Angela'),
(94828,80275,'Frank');

 * sqlite://
3 rows affected.

[]

In [10]:
%sql create table colleges(college_id int(20), contest_id int(20))

 * sqlite://
Done.

[]

In [11]:
%%sql 
insert into colleges (college_id, contest_id)
values
(11219,66406),
(32473,66556),
(56685,94828);

 * sqlite://
3 rows affected.

[]

In [12]:
%%sql

select c.hacker_id, col.contest_id from contests c, colleges col
where c.contest_id = col.contest_id

 * sqlite://
Done.

[(17973, 66406), (80275, 94828)]

In [16]:
%sql create table challenges(challenge_id int(20), college_id int(20))

 * sqlite://
Done.

[]

In [17]:
%%sql

insert into challenges(challenge_id,college_id)
values
(18765,11219),
(47127,11219),
(60292,32473),
(72974,56685);

 * sqlite://
4 rows affected.

[]

In [18]:
%sql create table view_stats(challenge_id int(20), total_views int(5),total_unique_views int(20))

 * sqlite://
Done.

[]

In [21]:
%%sql

insert into view_stats(challenge_id,total_views, total_unique_views)
values
(47127,26,19),
(47127,15,14),
(18765,43,10),
(18765,72,13),
(75516,35,17),
(72974,41,15),
(75516,75,11),
(60292,11,10);

 * sqlite://
8 rows affected.

[]

In [22]:
%sql create table submission_stats(challenge_id int(20), total_submissions int(5),total_accepted_submissions int(20))

 * sqlite://
Done.

[]

In [26]:
%%sql
insert into submission_stats (challenge_id,total_submissions, total_accepted_submissions)
values
(47127,26,19),
(47127,15,14),
(18765,43,10),
(18765,72,13),
(75516,35,17),
(72974,41,15),
(75516,75,11),
(60292,11,10);

 * sqlite://
8 rows affected.

[]

In [41]:
%%sql

SELECT con.contest_id, con.hacker_id, con.name, 
SUM(sg.total_submissions), SUM(sg.total_accepted_submissions), 
SUM(vg.total_views), SUM(vg.total_unique_views)
FROM Contests con
JOIN Colleges col ON con.contest_id = col.contest_id
JOIN Challenges cha ON cha.college_id = col.college_id
LEFT JOIN
(SELECT ss.challenge_id, SUM(ss.total_submissions) total_submissions, SUM(ss.total_accepted_submissions) total_accepted_submissions FROM Submission_Stats ss GROUP BY ss.challenge_id) sg
ON cha.challenge_id = sg.challenge_id
LEFT JOIN
(SELECT vs.challenge_id, SUM(vs.total_views) total_views, SUM(vs.total_unique_views) total_unique_views
FROM View_Stats vs GROUP BY vs.challenge_id) vg
ON cha.challenge_id = vg.challenge_id
GROUP BY con.contest_id, con.hacker_id, con.name
HAVING SUM(sg.total_submissions) +
       SUM(sg.total_accepted_submissions) +
       SUM(vg.total_views) +
       SUM(vg.total_unique_views) > 0
ORDER BY con.contest_id;

 * sqlite://
(sqlite3.OperationalError) no such table: contest [SQL: 'select c.contest_id, c.hacker_id, c.name, sum(v.total_views), sum(s.total_submissions) \nfrom \ncontest c, college col, view_stats v, submission_stats s, challenges ch\nwhere\nc.contest_id = col.contest_id\nand s.challenge_id = ch.challenge_id\nand  s.challenge_id = v.challenge_id;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [44]:
print(len(['ank','asd']))

2

In [45]:
a= 'pankaj'
for i,c in enumerate(a):
    print(i,c)

0 p
1 a
2 n
3 k
4 a
5 j